test/request-response-samples/execFile__valid_xml_generated_on_request_with_complex_type_element_form_default_qualified/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
<ns1:execFileParams xmlns:ns1="urn:FileExecutor">
			<ns1:fileName>PSTN</ns1:fileName>
			<ns1:arguments>0</ns1:arguments>
			<ns1:base64EncodedStdIn>null</ns1:base64EncodedStdIn>
			<ns1:startDetached>true</ns1:startDetached>
</ns1:execFileParams>
</soap:Body>
</soap:Envelope>