test/request-response-samples/execFile__valid_xml_generated_on_request_with_complex_type_element_form_default_unqualified/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
<ns1:execFileParams xmlns:ns1="urn:FileExecutor">
			<fileName>PSTN</fileName>
			<arguments>0</arguments>
			<base64EncodedStdIn>null</base64EncodedStdIn>
			<startDetached>true</startDetached>
</ns1:execFileParams>
</soap:Body>
</soap:Envelope>